osgp/platform/osgp-secret-management/src/integration-test/resources/test-requests/invalidStoreSecrets.xml

<!--
SPDX-FileCopyrightText: Contributors to the GXF project

SPDX-License-Identifier: Apache-2.0
-->

<soap:Envelope
  xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:ns="http://www.opensmartgridplatform.org/schemas/security/secretmanagement">
  <soap:Header>
    <ns:correlationUid>123456</ns:correlationUid>
  </soap:Header>
  <soap:Body>
    <ns:storeSecretsRequest
      xmlns:ns="http://www.opensmartgridplatform.org/schemas/security/secretmanagement">
    </ns:storeSecretsRequest>
  </soap:Body>
</soap:Envelope>
